{
    "title": "Thumbtack",
    "subtitle": "(2017 - Present)",
    "images": [
        {
            "file": "thumbtack.png",
            "alt_text": "Thumbtack"
        }
    ],
    "html_left": [
        "<p><a href='https://www.thumbtack.com'",
        "target='_blank'>Thumbtack</a> is transforming the way people",
        "complete projects. With Thumbtack, customers can hire professionals",
        "at just about anything, from painters to music teachers to",
        "personal chefs. I started as an intern at Thumbtack during",
        "the summers of 2015 and 2016, before converting to full-time in 2017.</p><p>",
        "I focus my attention primarily on our iOS apps (Swift) and API layer (Go + GraphQL),",
        "Here is a preview of some of the projects I have worked on:</p>",
        "<ul><li><p><b>Thumbprint iOS Design System: </b>Built many of the first UI components",
        "for our iOS design system and recently led the system's open-source release on GitHub.</p></li>",
        "<li><p><b>Instant Booking Consultations: </b>Helped build an entirely new customer and pro experience",
        "centered on enabling users to instantly schedule phone and on-site consultations with pros,",
        "significantly reducing the back-and-forth needed and improving the quality of leads for pros.</p></li>",
        "<li><p><b>Accessibility: </b>Championed a accessibility-first approach to",
        "feature development. Drove a 0% => 20% increase in Dynamic Type support across our apps,",
        "as well as improvements to support for Bold Text, VoiceOver, and other iOS accessibility features.",
        "Also created guidelines and best practices for both engineering and design to make developing an accessible",
        "product as efficient as possible.</p></li>",
        "<li><p><b>GraphQL Infrastructure/Tooling: </b>Spearheaded the foundational",
        "processes and infrastructure to enable use of GraphQL to communicate between",
        "our iOS apps and a new API service.</p></li>",
        "<li><p><b>Targeting: </b>Evolved our targeting system",
        "to maximize the supply health of our marketplace and give pros the",
        "controls they need to tell us what jobs they can do.</p></li>",
        "<li><p><b>iOS UI Component Playground: </b>Built an",
        "internal playground app for developers and designers to interactively",
        "develop and QA all the UI components for our iOS apps.</p></li></ul>"
    ]
}
